# DSCI 100 Group Project -- Aadi Kanwar

## Introduction

Our group has decided to analyze a dataset containing various categorical and numerical facts about individuals (education, income, and credit score being pertinent to this project), classifying the credit score categorically as either "Low" "Average" or "High". An individual's credit score describes their "creditworthiness", i.e their ability and trustworthiness to repay their debts. Therefore one can reason that a high credit score demonstrates a high "creditworthiness". Credit scores can be numerically represented, (and often are), but for the simplicity of this project, we have decided to classify credit scores between three categorical variables, (low, average, and high). If one wishes to consider these categories numerically, we consider a low credit score to be approximately 300, a high credit score to be around 800, and an average credit score to be around 550 (Investopedia, 2023). Given this information, we formulate the question: "What is a credit score of an individual classified as, when considering their income and education?". The specific data set that will be used to answer this question is titled "Credit Score Classification Dataset" and is provided by Sujith K. Mandala on Kaggle ([here is a direct link](https://www.kaggle.com/datasets/sujithmandala/credit-score-classification-dataset/data)).

## Preliminary Exploratory Data Analysis

### Reading the dataset into R from the web

In [1]:
install.packages("janitor")

Updating HTML index of packages in '.Library'

Making 'packages.html' ...
 done

In [11]:
library(tidyverse)
library(janitor)

url1 <- "https://raw.githubusercontent.com/aadikanwar/DSCI100_group_project/main/Credit%20Score%20Classification%20Dataset.csv"  # URL for the raw dataset, taken from the uploaded data set from our GitHub repo
download.file(url1, "data/credit_score_data.csv")  # downloading the file as a data file into the working directory 
data <- read_csv("data/credit_score_data.csv")  #reading the file into the notebook, 
head(data)

Rows: 164 Columns: 8
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (5): Gender, Education, Marital Status, Home Ownership, Credit Score
dbl (3): Age, Income, Number of Children

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

  Age Gender Income Education           Marital Status Number of Children
1 25  Female  50000 Bachelor's Degree   Single         0
2 30  Male   100000 Master's Degree     Married        2
3 35  Female  75000 Doctorate           Married        1
4 40  Male   125000 High School Diploma Single         0
5 45  Female 100000 Bachelor's Degree   Married        3
6 50  Male   150000 Master's Degree     Married        0
  Home Ownership Credit Score
1 Rented         High
2 Owned          High
3 Owned          High
4 Owned          High
5 Owned          High
6 Owned          High

### Cleaning and Wrangling the Data

In [19]:
clean_cs_data <- data |>
    clean_names()  # this is done to clean the column names and follow the proper tidy convention of column names being lowercase and seperated via underscores 

clean_cs_data <- clean_cs_data |>
    mutate(credit_score = as_factor(credit_score))  #converting the variable we wish to predict into a factor, which will prove to be helpful for analysis

clean_cs_data <- clean_cs_data |>
    select(income, education, credit_score)

head(clean_cs_data)

  income education           credit_score
1  50000 Bachelor's Degree   High
2 100000 Master's Degree     High
3  75000 Doctorate           High
4 125000 High School Diploma High
5 100000 Bachelor's Degree   High
6 150000 Master's Degree     High

The data presented is sensibly clean and wrangled appropriately. Each row is a singular observation, each column is a singular variable, and each cell contains a singular value, and so this data can be considered tidy. The names were cleaned to contain no spaces and be lowercase, and the credit_score column was wrangled such that it is represented as a factor, as that is what we wish to predict/classify. Only pertinent columns are selected (predictors: income and education, and the factor credit_score).

### Creating a Summary Table using Training Data

In [47]:
library(tidymodels)
cs_split <- initial_split(clean_cs_data, prop = 0.75, strata = credit_score)  #splitting the data into training and testing data
cs_training <- training(cs_split)
cs_testing <- testing(cs_split)

summary_table_1 <- cs_training |>  #displaying the count of each pre-existing class in the training data 
    count(credit_score)

summary_table_1

summary_table_2 <- cs_training |>  #displaying the count of the education predictor variables, also showing the types of educations 
    count(education)

summary_table_2

summary_table_3 <- cs_training |>  #displaying the count of the income predictor variables, showing the different income types and values  
    count(income)

summary_table_3

  credit_score n
1 High         85
2 Average      26
3 Low          11

  education           n
1 Associate's Degree  18
2 Bachelor's Degree   32
3 Doctorate           22
4 High School Diploma 23
5 Master's Degree     27

   income n
1   27500 3
2   32500 4
3   37500 4
4   40000 1
5   45000 1
6   47500 3
7   50000 2
8   52500 4
9   55000 2
10  57500 6
11  60000 3
12  62500 5
13  65000 3
14  67500 4
15  68000 1
16  70000 2
17  72500 2
18  75000 3
19  77500 4
20  80000 3
21  82500 1
22  85000 5
23  87500 4
24  90000 4
25  92500 3
26  95000 4
27  97500 2
28 100000 4
29 105000 5
30 110000 4
31 112500 2
32 115000 1
33 117500 2
34 120000 1
35 122500 2
36 125000 3
37 130000 4
38 135000 1
39 137500 1
40 140000 1
41 142500 1
42 145000 1
43 150000 2
44 155000 2
45 160000 1
46 162500 1